In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
df = sns.load_dataset("titanic")

In [7]:
df = df[["embark_town","sex"]]

In [8]:
df.head()

   embark_town     sex
0  Southampton    male
1    Cherbourg  female
2  Southampton  female
3  Southampton  female
4  Southampton    male

In [11]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [12]:
transform = ColumnTransformer(transformers=[
    ("trs1", OneHotEncoder(drop='first'), ["embark_town","sex"]),
], remainder="passthrough")

In [18]:
transform_data = transform.fit_transform(df)

In [22]:
ohe_columns = transform.named_transformers_['trs1'].get_feature_names_out(["embark_town", "sex"])

# Create DataFrame
df_transformed = pd.DataFrame(transform_data, columns=ohe_columns)

In [25]:
transform_data = df_transformed.astype(int)

In [28]:
transform_data

,embark_town_Queenstown,embark_town_Southampton,embark_town_nan,sex_male
0,0,1,0,1
1,0,0,0,0
2,0,1,0,0
3,0,1,0,0
4,0,1,0,1
...,...,...,...,...
886,0,1,0,1
887,0,1,0,0
888,0,1,0,0
889,0,0,0,1
890,1,0,0,1